# 是否使用喷砂间
USE_OF_THE_BLASTING_ROOM = True
# 进车数量,默认是当天早上进车一辆，中午进车一辆
NUMBER_OF_METRO_DROP_OFF = 500
# 转运车数量
NUMBER_OF_TRANS_SHIPMENT_VEHICLES = 2

# 是否启用转运车在喷砂间和总成分离的模式
ENABLING_SEPARATION_OF_TRANSFER_VEHICLES = True
# 各个转运车服务的台位
STATIONS_SERVICED_BY_TRANSFER_VANS = \
[
    ["进车台位", "粘接预装台位(1)", "粘接预装台位(2)"],
    ["自动化粘接台位", "普通组装1类", "模块化组装", "普通组装2类(A车)", "普通组装2类(BC车)", "落车台位"]
]
# 所有的台位
ALL_STAGE_CONFIG = \
{
    "进车台位":
    {
        "作业周期":3.5*60,
        "适用车型":["A", "B"],
        "具体台位":
        [
            {
                "台位号":"1",
                "转运时长":30
            }    
        ]
    },
    "粘接预装台位(1)":
    {
        "作业周期":3.5*60,
        "适用车型":["A", "B"],
        "具体台位":
        [
            {
                "台位号":"粘接预装台位(1)",
                "转运时长":10
            }  
        ]
    },
    "粘接预装台位(2)":
    {
        "作业周期":3.5*60,
        "适用车型":["A", "B"],
        "具体台位":
        [
            {
                "台位号":"粘接预装台位(2)",
                "转运时长":10
            }  
        ]
    },
    "自动化粘接台位":
    {
        "作业周期":3.5*60,
        "适用车型":["A", "B"],
        "具体台位":
        [
            {
                "台位号":"自动化粘接台位",
                "转运时长":30
            }
        ]
    },
    "普通组装1类":
    {
        "作业周期":21*60,
        "适用车型":["A", "B"],
        "具体台位":
        [
            {
                "台位号":"2",
                "转运时长":30
            },
            {
                "台位号":"3",
                "转运时长":30
            },
            {
                "台位号":"4",
                "转运时长":30
            },
            {
                "台位号":"5",
                "转运时长":30
            },
            {
                "台位号":"27",
                "转运时长":30
            },
            {
                "台位号":"28",
                "转运时长":30
            }
        ]
    },    
    "模块化组装":
    {
        "作业周期":7*60,
        "适用车型":["A", "B"],
        "具体台位":
        [
            {
                "台位号":"7",
                "转运时长":30
            },
            {
                "台位号":"8",
                "转运时长":30
            }
        ]
    }, 
    "普通组装2类(A车)":
    {
        "作业周期":72*60,
        "适用车型":["A"],
        "具体台位":
        [
            {
                "台位号":"11",
                "转运时长":30
            },
            {
                "台位号":"13",
                "转运时长":30
            },
            {
                "台位号":"15",
                "转运时长":30
            },
            {
                "台位号":"17",
                "转运时长":30
            },
            {
                "台位号":"19",
                "转运时长":30
            },
            {
                "台位号":"21",
                "转运时长":30
            }
        ]
    }, 
    "普通组装2类(BC车)":
    {
        "作业周期":72*60,
        "适用车型":["B"],
        "具体台位":
        [
            {
                "台位号":"12",
                "转运时长":60
            },
            {
                "台位号":"14",
                "转运时长":60
            },
            {
                "台位号":"16",
                "转运时长":60
            },
            {
                "台位号":"18",
                "转运时长":60
            },
            {
                "台位号":"20",
                "转运时长":60
            },
            {
                "台位号":"22",
                "转运时长":60
            },
            {
                "台位号":"23",
                "转运时长":30
            },
            {
                "台位号":"24",
                "转运时长":60
            },
            {
                "台位号":"25",
                "转运时长":30
            },
            {
                "台位号":"26",
                "转运时长":60
            },            
            {
                "台位号":"27",
                "转运时长":30
            },
            {
                "台位号":"28",
                "转运时长":60
            }
        ]
    },
    "落车台位":
    {
        "作业周期":3.5*60,
        "适用车型":["A", "B"],
        "具体台位":
        {
            {
                "台位号":"落车台位1",
                "转运时长":30
            },
            {
                "台位号":"落车台位2",
                "转运时长":30
            }
        }
    }
} 

